In [1]:
import numpy as np

In [3]:
np.random.randint(10)

0

In [4]:
ls=[1,2,3]
np.array(ls)

array([1, 2, 3])

In [5]:
ls=[]
for i in range(10):
    if(i%2==0):
        ls.append(np.random.randint(50))
    else:
        ls.append(np.random.randint(50,100))

In [6]:
ls

[28, 60, 2, 58, 28, 81, 25, 65, 26, 64]

In [7]:
ls=[x for x in range(10)]

In [40]:
ls=[x for x in range(12) if x%2==0]

In [41]:
ls

[0, 2, 4, 6, 8, 10]

In [42]:
np.arange(10,100,2)

array([10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42,
       44, 46, 48, 50, 52, 54, 56, 58, 60, 62, 64, 66, 68, 70, 72, 74, 76,
       78, 80, 82, 84, 86, 88, 90, 92, 94, 96, 98])

np.zeroes((2,2))

In [43]:
np.linspace(0,100,10)

array([  0.        ,  11.11111111,  22.22222222,  33.33333333,
        44.44444444,  55.55555556,  66.66666667,  77.77777778,
        88.88888889, 100.        ])

In [44]:
ls=np.array(ls)
ls.reshape(2,3)

array([[ 0,  2,  4],
       [ 6,  8, 10]])

array([ True,  True, False, False])

In [64]:
import pandas as pd

In [66]:
a=[[10,20,30],[40,np.nan,60],[70,np.nan,np.nan]]
a=np.array(a)
df=pd.DataFrame(a)
df

      0     1     2
0  10.0  20.0  30.0
1  40.0   NaN  60.0
2  70.0   NaN   NaN

In [70]:
df=df.dropna(thresh=2)

In [71]:
df.fillna(df.mean())

      0     1     2
0  10.0  20.0  30.0
1  40.0  20.0  60.0

In [76]:
b=np.arange(24)
b=b.reshape(6,4)
b.shape

(6, 4)

In [79]:
df1=pd.DataFrame(data=b,columns=['A','B','C','D'])
df1

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5  20  21  22  23

In [84]:
a=np.arange(50,74)
a=a.reshape(6,4)
a.shape

(6, 4)

In [99]:
df2=pd.DataFrame(data=a,columns=['A','B','C','D'])
df2

    A   B   C   D
0  50  51  52  53
1  54  55  56  57
2  58  59  60  61
3  62  63  64  65
4  66  67  68  69
5  70  71  72  73

In [107]:
df3=[df1,df2]

In [109]:
df4=pd.concat(df3)
df4

    A   B   C   D
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5  20  21  22  23
0  50  51  52  53
1  54  55  56  57
2  58  59  60  61
3  62  63  64  65
4  66  67  68  69
5  70  71  72  73

In [110]:
df3

[    A   B   C   D
 0   0   1   2   3
 1   4   5   6   7
 2   8   9  10  11
 3  12  13  14  15
 4  16  17  18  19
 5  20  21  22  23,     A   B   C   D
 0  50  51  52  53
 1  54  55  56  57
 2  58  59  60  61
 3  62  63  64  65
 4  66  67  68  69
 5  70  71  72  73]

In [111]:
df3=pd.concat(df3,axis=1)

In [112]:
df3

    A   B   C   D   A   B   C   D
0   0   1   2   3  50  51  52  53
1   4   5   6   7  54  55  56  57
2   8   9  10  11  58  59  60  61
3  12  13  14  15  62  63  64  65
4  16  17  18  19  66  67  68  69
5  20  21  22  23  70  71  72  73